//======================================================================================================================
//
//	3D数値ヘッダー [3Dvalue.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _3DVALUE_H_			// このマクロ定義がされていない場合
#define _3DVALUE_H_			// 二重インクルード防止のマクロを定義する

#include "main.h"

//**********************************************************************************************************************
//	列挙型定義 (VALUETYPE)
//**********************************************************************************************************************
typedef enum
{
	VALUE3DTYPE_NORMAL = 0,		// 数字 (通常)
	VALUE3DTYPE_RED,			// 数字 (赤)
	VALUE3DTYPE_MAX,			// この列挙型の総数
} VALUE3DTYPE;

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void Init3DValue(void);						// 3Dの数値の初期化処理
void Uninit3DValue(void);					// 3Dの数値の終了処理
void Update3DValue(void);					// 3Dの数値の更新処理
void Draw3DValue(D3DXVECTOR3 pos, int nDigit, int nType);	// 3Dの数値の描画処理
void Set3DValue(int n3DValue, int nMax3DValue, float fWidth, float fHeight, float fAlpha);	// 数値の設定処理

#endif