//======================================================================================================================
//
//	ビルボードヘッダー [billboard.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _BILLBOARD_H_				// このマクロ定義がされていない場合
#define _BILLBOARD_H_				// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitBillboard(void);			// ビルボードの初期化処理
void UninitBillboard(void);			// ビルボードの終了処理
void UpdateBillboard(void);			// ビルボードの更新処理
void DrawBillboard(void);			// ビルボードの描画処理
void SetBillboard(D3DXVECTOR3 pos);	// ビルボードの設定処理

#endif