//============================================================
//
//	亡骸ヘッダー [death.h]
//	Author：小原立暉
//
//============================================================
#ifndef _DEATH_H_		// このマクロ定義がされていない場合
#define _DEATH_H_		// 二重インクルード防止のマクロを定義する

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "model.h"

//************************************************************
//	マクロ定義
//************************************************************

//************************************************************
//	構造体定義 (Death)
//************************************************************
typedef struct
{
	D3DXVECTOR3 pos;				// 現在の位置
	D3DXVECTOR3 rot;				// 向き
	D3DXMATRIX  mtxWorld;			// ワールドマトリックス
	Model		modelData;			// モデルの情報
	int         nShadowID;			// 影のインデックス
	int			nSmokeCnt;			// 黒煙が出るカウント
	bool		bUse;				// 使用状況
}Death;

//************************************************************
//	プロトタイプ宣言
//************************************************************
void InitDeath(void);				// プレイヤーの初期化処理
void UninitDeath(void);				// プレイヤーの終了処理
void UpdateDeath(void);				// プレイヤーの更新処理
void DrawDeath(void);				// プレイヤーの描画処理
void SetDeath(D3DXVECTOR3 pos, D3DXVECTOR3 rot);		// プレイヤーの描画処理

//************************************************************
//	プロトタイプ宣言 (デバッグ用)
//************************************************************

#endif