//======================================================================================================================
//
//	メッシュドームヘッダー [meshdome.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _MESHDOME_H_			// このマクロ定義がされていない場合
#define _MESHDOME_H_			// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitMeshDome(void);		// メッシュドームの初期化処理
void UninitMeshDome(void);		// メッシュドームの終了処理
void UpdateMeshDome(void);		// メッシュドームの更新処理
void DrawMeshDome(void);		// メッシュドームの描画処理

#endif