//======================================================================================================================
//
//	メッシュフィールドヘッダー [meshfield.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _MESHFIELD_H_			// このマクロ定義がされていない場合
#define _MESHFIELD_H_			// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitMeshField(void);		// メッシュフィールドの初期化処理
void UninitMeshField(void);		// メッシュフィールドの終了処理
void UpdateMeshField(void);		// メッシュフィールドの更新処理
void DrawMeshField(void);		// メッシュフィールドの描画処理

#endif