//======================================================================================================================
//
//	メッシュシリンダーヘッダー [meshcylinder.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _MESHCYLINDER_H_			// このマクロ定義がされていない場合
#define _MESHCYLINDER_H_			// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitMeshCylinder(void);		// メッシュシリンダーの初期化処理
void UninitMeshCylinder(void);		// メッシュシリンダーの終了処理
void UpdateMeshCylinder(void);		// メッシュシリンダーの更新処理
void DrawMeshCylinder(void);		// メッシュシリンダーの描画処理

#endif