//======================================================================================================================
//
//	パーティクルヘッダー [particle.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _PARTICLE_H_			// このマクロ定義がされていない場合
#define _PARTICLE_H_			// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	インクルードファイル
//**********************************************************************************************************************
#include "main.h"

//**********************************************************************************************************************
//	マクロ定義
//**********************************************************************************************************************
#define SPAWN_PARTICLE_EXPLOSION	(8)		// パーティクル (爆発) のエフェクト数
#define SPAWN_PARTICLE_DAMAGE		(10)	// パーティクル (ダメージ) のエフェクト数
#define SPAWN_PARTICLE_DUST			(4)		// パーティクル（埃）のエフェクト数
#define SPAWN_PARTICLE_RAINSPRAY	(8)		// パーティクル（水しぶき）のエフェクト数
#define SPAWN_PARTICLE_SMOKING		(1)		// パーティクル（タバコの煙）のエフェクト数
#define SPAWN_PARTICLE_ITEM_LOST	(10)	// パーティクル（アイテム消失）のエフェクト数
#define SPAWN_PARTICLE_PLAY_SMOKE	(20)	// パーティクル（プレイヤーの黒煙）のエフェクト数
#define SPAWN_PARTICLE_BREAKARTICLE	(15)	// パーティクル（小物の破壊時の煙）のエフェクト数
#define SPAWN_PARTICLE_BREAKOBJECT	(15)	// パーティクル（オブジェクトの破壊時の煙）のエフェクト数
#define SPAWN_PARTICLE_PLAYERDEATH	(20)	// パーティクル（プレイヤーの死亡爆発）のエフェクト数
#define SPAWN_PARTICLE_SHOT_BARRIER	(6)		// パーティクル (バリア発射) のエフェクト数

//**********************************************************************************************************************
//	列挙型定義 (PARTICLETYPE)
//**********************************************************************************************************************
typedef enum
{
	PARTICLETYPE_NONE = 0,		// パーティクル (何もしない)
	PARTICLETYPE_EXPLOSION,		// パーティクル (爆発)
	PARTICLETYPE_DAMAGE,		// パーティクル (ダメージ)
	PARTICLETYPE_BOOST,			// パーティクル (ブースト)
	PARTICLETYPE_SPARK,			// パーティクル（火花）
	PARTICLETYPE_DUST,			// パーティクル (埃)
	PARTICLETYPE_RAINSPRAY,		// パーティクル（水飛沫）
	PARTICLETYPE_ITEM_LOST,		// パーティクル（アイテム消失）
	PARTICLETYPE_PLAY_SMOKE,	// パーティクル（プレイヤーの黒煙）
	PARTICLETYPE_BREAK_ARTICLE,	// パーティクル（小物の破壊時）
	PARTICLETYPE_BREAK_OBJECT,	// パーティクル（オブジェクトの破壊時）
	PARTICLETYPE_PLAY_DEATH,	// パーティクル（プレイヤーの死亡爆発）
	PARTICLETYPE_OBJECT_SMASH,	// パーティクル（オブジェクトを吹っ飛ばした時）
	PARTICLETYPE_SHOT_BARRIER,	// パーティクル（バリア発射）
	PARTICLETYPE_MAX,			// この列挙型の総数
} PARTICLETYPE;

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitParticle(void);		// パーティクルの初期化処理
void UninitParticle(void);		// パーティクルの終了処理
void UpdateParticle(void);		// パーティクルの更新処理
void DrawParticle(void);		// パーティクルの描画処理

void SetParticle(D3DXVECTOR3 pos, D3DXCOLOR col, PARTICLETYPE type, int nSpawn, int nLife);		// パーティクルの設定処理

void AllFalseParticle(void);	// パーティクルの削除

//**********************************************************************************************************************
//	プロトタイプ宣言 (デバッグ用)
//**********************************************************************************************************************
int GetNumParticle(void);		// パーティクルの総数取得処理

#endif