//======================================================================================================================
//
//	ポーズ画面ヘッダー [pause.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _PAUSE_H_						// このマクロ定義がされていない場合
#define _PAUSE_H_						// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	列挙型定義 (PAUSESELECT)
//**********************************************************************************************************************
typedef enum
{
	PAUSESELECT_RESUME = 0,				// 再開状態
	PAUSESELECT_RETRY,					// リトライ状態
	PAUSESELECT_EXIT,					// 終了状態
	PAUSESELECT_MAX						// この列挙型の総数
} PAUSESELECT;

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitPause(void);					// ポーズの画面初期化処理
void UninitPause(void);					// ポーズの画面終了処理
void UpdatePause(void);					// ポーズの画面更新処理
void DrawPause(void);					// ポーズの画面描画処理
void SetEnablePauseEnd(bool bPauseEnd);	// ポーズの真偽の設定処理
bool GetPauseEnd(void);					// ポーズの状態の取得処理
void ResetPauseSelect(void);			// ポーズの選択項目の再設定処理

#endif