//===================================
//
// 褒め言葉ヘッダー[praise.h]
// Author 小原立暉
//
//===================================
#ifndef _PRAISE_H_
#define _PRAISE_H_

#include "main.h"

//**********************************************************************************************************************
// マクロ定義
//**********************************************************************************************************************

//**********************************************************************************************************************
// 構造体定義(PRAISESTATE)
//**********************************************************************************************************************
typedef enum
{
	PRAISESTATE_APPEAR = 0,			// 出現状態
	PRAISESTATE_NONE,				// 通常状態
	PRAISESTATE_LAPSE,				// 消滅状態
	PRAISESTATE_MAX					// この列挙型の総数
}PRAISESTATE;

//**********************************************************************************************************************
// コンボの構造体
//**********************************************************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXVECTOR3 rot;		// 向き
	D3DXVECTOR3 size;		// サイズ
	PRAISESTATE state;		// 状態
	int			nCount;		// 消滅カウンター
	int			nNumTex;	// テクスチャの番号
	float		fAngle;		// 方向
	float		fLength;	// 長さ
	bool		bUse;		// 使用状況
}Praise;

//**********************************************************************************************************************
//プロトタイプ宣言
//**********************************************************************************************************************
void InitPraise(void);			// 褒め言葉の初期化処理
void UninitPraise(void);		// 褒め言葉の終了処理
void UpdatePraise(void);		// 褒め言葉の更新処理
void DrawPraise(void);			// 褒め言葉の描画処理
void SetPraise(void);			// 褒め言葉の設定処理

#endif