//=======================================================================================================
//
//	影ヘッダー [shadow.h]
//	Author：藤田勇一
//
//=======================================================================================================
#ifndef _SHADOW_H_				// このマクロ定義がされていない場合
#define _SHADOW_H_				// 二重インクルード防止のマクロを定義する

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"

//************************************************************
//	マクロ定義
//************************************************************
#define NONE_SHADOW		(-1)	// 影の初期値 (使用していない場合)

//************************************************************
//	プロトタイプ宣言
//************************************************************
void InitShadow(void);			// 影の初期化処理
void UninitShadow(void);		// 影の終了処理
void UpdateShadow(void);		// 影の更新処理
void DrawShadow(void);			// 影の描画処理
int  SetShadow(float fAlpha, float fRadius, int *pShadowID, bool *pUse);	// 影の設定処理
void SetPositionShadow(int nShadowID, D3DXVECTOR3 pos);						// 影の位置の設定処理

#endif