//======================================================================================================================
//
//	数値ヘッダー [value.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _VALUE_H_			// このマクロ定義がされていない場合
#define _VALUE_H_			// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	列挙型定義 (VALUETYPE)
//**********************************************************************************************************************
typedef enum
{
	VALUETYPE_NORMAL = 0,	// 数字 (通常)
	VALUETYPE_MAX,			// この列挙型の総数
} VALUETYPE;

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitValue(void);					// 数値の初期化処理
void UninitValue(void);					// 数値の終了処理
void UpdateValue(void);					// 数値の更新処理
void DrawValue(int nDigit, int nType);	// 数値の描画処理
void SetValue(D3DXVECTOR3 pos, int nValue, int nMaxValue, float fWidth, float fHeight, float fSpace, float fAlpha);	// 数値の設定処理

#endif